; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_13)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - person
	)

  (:init
		(= (x b0) -1)
(= (y b0) 0)
(= (x b1) 2)
(= (y b1) 0)
(= (x b2) -1)
(= (y b2) 0)
(= (x b3) 1)
(= (y b3) 0)
(= (x b4) 4)
(= (y b4) 0)
(= (x b5) 7)
(= (y b5) 0)
(= (x b6) -2)
(= (y b6) 0)
(= (x b7) 3)
(= (y b7) 0)
(= (x b8) -3)
(= (y b8) 0)
(= (x b9) 8)
(= (y b9) 0)

		(= (d p0) 16)
(= (d p1) 70)
(= (d p2) 23)
(= (d p3) 79)
(= (d p4) 42)
(= (d p5) 13)
(= (d p6) 84)
(= (d p7) 53)
(= (d p8) 92)
(= (d p9) 95)
(= (d p10) 47)
(= (d p11) 84)
(= (d p12) 78)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
		)
	)
)

; plan
1. (go_north_east b2)
   changed: (x b2) from -1 to 0.5, (y b2) from 0 to 1.5
   goals met: 0 of 13
2. (go_north_east b2)
   changed: (x b2) from 0.5 to 2, (y b2) from 1.5 to 3
   goals met: 0 of 13
3. (go_north_east b2)
   changed: (x b2) from 2 to 3.5, (y b2) from 3 to 4.5
   goals met: 0 of 13
4. (go_north_east b2)
   changed: (x b2) from 3.5 to 5, (y b2) from 4.5 to 6
   goals met: 0 of 13
5. (go_north_east b2)
   changed: (x b2) from 5 to 6.5, (y b2) from 6 to 7.5
   goals met: 0 of 13
6. (go_north_east b2)
   changed: (x b2) from 6.5 to 8, (y b2) from 7.5 to 9
   goals met: 0 of 13
7. (go_north_east b2)
   changed: (x b2) from 8 to 9.5, (y b2) from 9 to 10.5
   goals met: 0 of 13
8. (go_north_east b2)
   changed: (x b2) from 9.5 to 11, (y b2) from 10.5 to 12
   goals met: 0 of 13
9. (go_north_east b2)
   changed: (x b2) from 11 to 12.5, (y b2) from 12 to 13.5
   goals met: 0 of 13
10. (go_north_east b2)
   changed: (x b2) from 12.5 to 14, (y b2) from 13.5 to 15
   goals met: 0 of 13
11. (go_north_east b2)
   changed: (x b2) from 14 to 15.5, (y b2) from 15 to 16.5
   goals met: 0 of 13
12. (go_north_east b2)
   changed: (x b2) from 15.5 to 17, (y b2) from 16.5 to 18
   goals met: 0 of 13
13. (go_north_east b2)
   changed: (x b2) from 17 to 18.5, (y b2) from 18 to 19.5
   goals met: 0 of 13
14. (go_north_east b2)
   changed: (x b2) from 18.5 to 20, (y b2) from 19.5 to 21
   goals met: 0 of 13
15. (go_north_east b2)
   changed: (x b2) from 20 to 21.5, (y b2) from 21 to 22.5
   goals met: 0 of 13
16. (go_west b2)
   changed: (x b2) from 21.5 to 18.5
   goals met: 0 of 13
17. (go_west b2)
   changed: (x b2) from 18.5 to 15.5
   goals met: 0 of 13
18. (go_west b2)
   changed: (x b2) from 15.5 to 12.5
   goals met: 0 of 13
19. (go_west b2)
   changed: (x b2) from 12.5 to 9.5
   goals met: 0 of 13
20. (go_north_east b2)
   changed: (x b2) from 9.5 to 11, (y b2) from 22.5 to 24
   goals met: 0 of 13
21. (go_north_east b2)
   changed: (x b2) from 11 to 12.5, (y b2) from 24 to 25.5
   goals met: 0 of 13
22. (go_north_east b2)
   changed: (x b2) from 12.5 to 14, (y b2) from 25.5 to 27
   goals met: 0 of 13
23. (go_north_east b2)
   changed: (x b2) from 14 to 15.5, (y b2) from 27 to 28.5
   goals met: 0 of 13
24. (go_west b2)
   changed: (x b2) from 15.5 to 12.5
   goals met: 0 of 13
25. (save_person b2 p0)
   added: (saved p0)
   goals met: 1 of 13
26. (go_west b2)
   changed: (x b2) from 12.5 to 9.5
   goals met: 1 of 13
27. (save_person b2 p5)
   added: (saved p5)
   goals met: 2 of 13
28. (go_north_east b2)
   changed: (x b2) from 9.5 to 11, (y b2) from 28.5 to 30
   goals met: 2 of 13
29. (go_north_east b2)
   changed: (x b2) from 11 to 12.5, (y b2) from 30 to 31.5
   goals met: 2 of 13
30. (go_north_west b2)
   changed: (x b2) from 12.5 to 11, (y b2) from 31.5 to 33
   goals met: 2 of 13
31. (go_north_west b2)
   changed: (x b2) from 11 to 9.5, (y b2) from 33 to 34.5
   goals met: 2 of 13
32. (save_person b2 p2)
   added: (saved p2)
   goals met: 3 of 13
33. (go_north_east b2)
   changed: (x b2) from 9.5 to 11, (y b2) from 34.5 to 36
   goals met: 3 of 13
34. (go_north_east b2)
   changed: (x b2) from 11 to 12.5, (y b2) from 36 to 37.5
   goals met: 3 of 13
35. (go_north_east b2)
   changed: (x b2) from 12.5 to 14, (y b2) from 37.5 to 39
   goals met: 3 of 13
36. (go_north_east b2)
   changed: (x b2) from 14 to 15.5, (y b2) from 39 to 40.5
   goals met: 3 of 13
37. (go_north_east b2)
   changed: (x b2) from 15.5 to 17, (y b2) from 40.5 to 42
   goals met: 3 of 13
38. (go_north_east b2)
   changed: (x b2) from 17 to 18.5, (y b2) from 42 to 43.5
   goals met: 3 of 13
39. (go_north_east b2)
   changed: (x b2) from 18.5 to 20, (y b2) from 43.5 to 45
   goals met: 3 of 13
40. (go_north_east b2)
   changed: (x b2) from 20 to 21.5, (y b2) from 45 to 46.5
   goals met: 3 of 13
41. (go_north_east b2)
   changed: (x b2) from 21.5 to 23, (y b2) from 46.5 to 48
   goals met: 3 of 13
42. (go_north_west b2)
   changed: (x b2) from 23 to 21.5, (y b2) from 48 to 49.5
   goals met: 3 of 13
43. (go_north_west b2)
   changed: (x b2) from 21.5 to 20, (y b2) from 49.5 to 51
   goals met: 3 of 13
44. (go_north_west b2)
   changed: (x b2) from 20 to 18.5, (y b2) from 51 to 52.5
   goals met: 3 of 13
45. (go_north_west b2)
   changed: (x b2) from 18.5 to 17, (y b2) from 52.5 to 54
   goals met: 3 of 13
46. (go_north_west b2)
   changed: (x b2) from 17 to 15.5, (y b2) from 54 to 55.5
   goals met: 3 of 13
47. (go_north_west b2)
   changed: (x b2) from 15.5 to 14, (y b2) from 55.5 to 57
   goals met: 3 of 13
48. (go_north_west b2)
   changed: (x b2) from 14 to 12.5, (y b2) from 57 to 58.5
   goals met: 3 of 13
49. (go_north_west b2)
   changed: (x b2) from 12.5 to 11, (y b2) from 58.5 to 60
   goals met: 3 of 13
50. (save_person b2 p10)
   added: (saved p10)
   goals met: 4 of 13
51. (go_north_west b2)
   changed: (x b2) from 11 to 9.5, (y b2) from 60 to 61.5
   goals met: 4 of 13
52. (go_north_west b2)
   changed: (x b2) from 9.5 to 8, (y b2) from 61.5 to 63
   goals met: 4 of 13
53. (save_person b2 p7)
   added: (saved p7)
   goals met: 5 of 13
54. (go_north_west b2)
   changed: (x b2) from 8 to 6.5, (y b2) from 63 to 64.5
   goals met: 5 of 13
55. (go_north_west b2)
   changed: (x b2) from 6.5 to 5, (y b2) from 64.5 to 66
   goals met: 5 of 13
56. (go_north_west b2)
   changed: (x b2) from 5 to 3.5, (y b2) from 66 to 67.5
   goals met: 5 of 13
57. (go_north_west b2)
   changed: (x b2) from 3.5 to 2, (y b2) from 67.5 to 69
   goals met: 5 of 13
58. (go_north_west b2)
   changed: (x b2) from 2 to 0.5, (y b2) from 69 to 70.5
   goals met: 5 of 13
59. (save_person b2 p1)
   added: (saved p1)
   goals met: 6 of 13
60. (go_north_east b2)
   changed: (x b2) from 0.5 to 2, (y b2) from 70.5 to 72
   goals met: 6 of 13
61. (go_north_east b2)
   changed: (x b2) from 2 to 3.5, (y b2) from 72 to 73.5
   goals met: 6 of 13
62. (go_north_east b2)
   changed: (x b2) from 3.5 to 5, (y b2) from 73.5 to 75
   goals met: 6 of 13
63. (go_north_east b2)
   changed: (x b2) from 5 to 6.5, (y b2) from 75 to 76.5
   goals met: 6 of 13
64. (go_north_east b2)
   changed: (x b2) from 6.5 to 8, (y b2) from 76.5 to 78
   goals met: 6 of 13
65. (go_north_east b2)
   changed: (x b2) from 8 to 9.5, (y b2) from 78 to 79.5
   goals met: 6 of 13
66. (go_north_east b2)
   changed: (x b2) from 9.5 to 11, (y b2) from 79.5 to 81
   goals met: 6 of 13
67. (go_west b2)
   changed: (x b2) from 11 to 8
   goals met: 6 of 13
68. (go_west b2)
   changed: (x b2) from 8 to 5
   goals met: 6 of 13
69. (go_west b2)
   changed: (x b2) from 5 to 2
   goals met: 6 of 13
70. (save_person b2 p3)
   added: (saved p3)
   goals met: 7 of 13
71. (save_person b2 p12)
   added: (saved p12)
   goals met: 8 of 13
72. (go_north_east b2)
   changed: (x b2) from 2 to 3.5, (y b2) from 81 to 82.5
   goals met: 8 of 13
73. (go_north_east b2)
   changed: (x b2) from 3.5 to 5, (y b2) from 82.5 to 84
   goals met: 8 of 13
74. (go_north_east b2)
   changed: (x b2) from 5 to 6.5, (y b2) from 84 to 85.5
   goals met: 8 of 13
75. (go_north_east b2)
   changed: (x b2) from 6.5 to 8, (y b2) from 85.5 to 87
   goals met: 8 of 13
76. (go_north_west b2)
   changed: (x b2) from 8 to 6.5, (y b2) from 87 to 88.5
   goals met: 8 of 13
77. (go_north_west b2)
   changed: (x b2) from 6.5 to 5, (y b2) from 88.5 to 90
   goals met: 8 of 13
78. (save_person b2 p6)
   added: (saved p6)
   goals met: 9 of 13
79. (save_person b2 p11)
   added: (saved p11)
   goals met: 10 of 13
80. (go_north_west b2)
   changed: (x b2) from 5 to 3.5, (y b2) from 90 to 91.5
   goals met: 10 of 13
81. (go_north_west b2)
   changed: (x b2) from 3.5 to 2, (y b2) from 91.5 to 93
   goals met: 10 of 13
82. (go_north_west b2)
   changed: (x b2) from 2 to 0.5, (y b2) from 93 to 94.5
   goals met: 10 of 13
83. (save_person b2 p8)
   added: (saved p8)
   goals met: 11 of 13
84. (go_north_west b2)
   changed: (x b2) from 0.5 to -1, (y b2) from 94.5 to 96
   goals met: 11 of 13
85. (save_person b2 p9)
   added: (saved p9)
   goals met: 12 of 13
86. (go_south_west b2)
   changed: (x b2) from -1 to 1, (y b2) from 96 to 94
   goals met: 12 of 13
87. (go_south_west b2)
   changed: (x b2) from 1 to 3, (y b2) from 94 to 92
   goals met: 12 of 13
88. (go_south_west b2)
   changed: (x b2) from 3 to 5, (y b2) from 92 to 90
   goals met: 12 of 13
89. (go_south_west b2)
   changed: (x b2) from 5 to 7, (y b2) from 90 to 88
   goals met: 12 of 13
90. (go_south_west b2)
   changed: (x b2) from 7 to 9, (y b2) from 88 to 86
   goals met: 12 of 13
91. (go_south_west b2)
   changed: (x b2) from 9 to 11, (y b2) from 86 to 84
   goals met: 12 of 13
92. (go_south_west b2)
   changed: (x b2) from 11 to 13, (y b2) from 84 to 82
   goals met: 12 of 13
93. (go_south_west b2)
   changed: (x b2) from 13 to 15, (y b2) from 82 to 80
   goals met: 12 of 13
94. (go_south_east b2)
   changed: (x b2) from 15 to 13, (y b2) from 80 to 78
   goals met: 12 of 13
95. (go_south_east b2)
   changed: (x b2) from 13 to 11, (y b2) from 78 to 76
   goals met: 12 of 13
96. (go_south_east b2)
   changed: (x b2) from 11 to 9, (y b2) from 76 to 74
   goals met: 12 of 13
97. (go_south_east b2)
   changed: (x b2) from 9 to 7, (y b2) from 74 to 72
   goals met: 12 of 13
98. (go_south_east b2)
   changed: (x b2) from 7 to 5, (y b2) from 72 to 70
   goals met: 12 of 13
99. (go_south_east b2)
   changed: (x b2) from 5 to 3, (y b2) from 70 to 68
   goals met: 12 of 13
100. (go_south_east b2)
   changed: (x b2) from 3 to 1, (y b2) from 68 to 66
   goals met: 12 of 13
101. (save_person b2 p4)
   added: (saved p4)
   goals met: 13 of 13
